ExprovipFuel/src/Reports/АктСверки/АктСверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АктСверки</name>
</mdclass:Report>

ExprovipFuel/src/AccumulationRegisters/ВзаиморасчетыКлиенты/ВзаиморасчетыКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыКлиенты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаТранзакции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ExprovipFuel/src/InformationRegisters/НомераФактур/НомераФактур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераФактур</name>
  <resources>
    <name>НомерФактуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Фактура</name>
    <type>
      <types>DocumentRef.Фактура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/Reports/АктСверки/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьНаСервере()
	
	Результат.Очистить();
	
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
	ОбластьОбороты			= Макет.ПолучитьОбласть("ОборотыЗаПериод");
	ОбластьСальдо			= Макет.ПолучитьОбласть("Сальдо");
	ОбластьСальдоПропись	= Макет.ПолучитьОбласть("СальдоПрописью");
		
	ТаблицаИтоговПоВзаиморасчетам = ТаблицаИтоговПоВзаиморасчетам();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПериодОтчета.ДатаОкончания);
	Запрос.УстановитьПараметр("Контрагенты", СписокКонтрагентов.ВыгрузитьЗначения());
	//@skip-check ql-temp-table-index
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ ТаблицаКонтрагентов
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ЭтоГруппа
	|	И Контрагенты.Ссылка В ИЕРАРХИИ (&Контрагенты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКонтрагентов.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(ВзаиморасчетыКлиентыОбороты.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
	|	ЕСТЬNULL(ВзаиморасчетыКлиентыОбороты.Регистратор, """") КАК Регистратор,
	|	ЕСТЬNULL(ВзаиморасчетыКлиентыОбороты.СуммаПриход, 0) КАК Кредит,
	|	ЕСТЬNULL(ВзаиморасчетыКлиентыОбороты.СуммаРасход, 0) КАК Дебет,
	|	ЕСТЬNULL(ВзаиморасчетыКлиентыОбороты.ПериодДень, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодДень,
	|	ЕСТЬNULL(НомераФактур.НомерФактуры, 0) КАК НомерФактуры,
	|	ЕСТЬNULL(ВзаиморасчетыКлиентыОбороты.НомерСтроки, 0) КАК НомерСтроки
	|ИЗ
	|	ТаблицаКонтрагентов КАК ТаблицаКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКлиенты.Обороты(&НачалоПериода, &КонецПериода, Авто, Контрагент
	|			В ИЕРАРХИИ (&Контрагенты)) КАК ВзаиморасчетыКлиентыОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераФактур КАК НомераФактур
	|			ПО ВзаиморасчетыКлиентыОбороты.Контрагент = НомераФактур.Контрагент
	|			И ВзаиморасчетыКлиентыОбороты.Регистратор = НомераФактур.Фактура
	|		ПО ТаблицаКонтрагентов.Контрагент = ВзаиморасчетыКлиентыОбороты.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	ПериодДень
	|ИТОГИ
	|ПО
	|	Контрагент";
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	Пока ВыборкаКонтрагент.Следующий() Цикл
		ОбластьШапка.Параметры.НачалоПериода	= Формат(ПериодОтчета.ДатаНачала, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.КонецПериода		= Формат(ПериодОтчета.ДатаОкончания, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.Контрагент		= ВыборкаКонтрагент.Контрагент;
		
		Результат.Вывести(ОбластьШапка);
		
		Счетчик = 0;
		
		ТаблицаИтогов = ТаблицаИтогов();
		
		ВыборкаДетальныеЗаписи = ВыборкаКонтрагент.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Счетчик = Счетчик + 1;
			
			ОбластьСтрока.Параметры.Счетчик			= Счетчик;
			ОбластьСтрока.Параметры.ДатаФактуры		= ВыборкаДетальныеЗаписи.ПериодДень;
			ОбластьСтрока.Параметры.НомерФактуры	= ВыборкаДетальныеЗаписи.НомерФактуры;
			ОбластьСтрока.Параметры.Валюта			= ВыборкаДетальныеЗаписи.Валюта;
			ОбластьСтрока.Параметры.Дебет			= ВыборкаДетальныеЗаписи.Дебет;
			ОбластьСтрока.Параметры.Кредит			= ВыборкаДетальныеЗаписи.Кредит;
			
			Результат.Вывести(ОбластьСтрока);
			
			НоваяСтрока = ТаблицаИтогов.Добавить();
			НоваяСтрока.Валюта	= ВыборкаДетальныеЗаписи.Валюта;
			НоваяСтрока.Дебет	= ВыборкаДетальныеЗаписи.Дебет;
			НоваяСтрока.Кредит	= ВыборкаДетальныеЗаписи.Кредит;
			
		КонецЦикла;
		ТаблицаИтогов.Свернуть("Валюта", "Дебет, Кредит");
		
		Для Каждого СтрокаИтогов Из ТаблицаИтогов Цикл
			ЗаполнитьЗначенияСвойств(ОбластьОбороты.Параметры, СтрокаИтогов);
			Результат.Вывести(ОбластьОбороты);
		КонецЦикла;
		
		ДатаСальдо = КонецДня(ПериодОтчета.ДатаОкончания) + 1;
		
		МассивСтрокиСальдо = ТаблицаИтоговПоВзаиморасчетам.НайтиСтроки(Новый Структура("Контрагент", ВыборкаКонтрагент.Контрагент));
		Для Каждого СтрокаИтоговПоВзаиморасчетам Из МассивСтрокиСальдо Цикл
			ОбластьСальдо.Параметры.ДатаСальдо = Формат(ДатаСальдо, "ДФ=dd.MM.yyyy");
			ОбластьСальдо.Параметры.Валюта = СтрокаИтоговПоВзаиморасчетам.Валюта;
			ОбластьСальдо.Параметры.Сальдо = СтрокаИтоговПоВзаиморасчетам.СуммаОстаток;
			
			Результат.Вывести(ОбластьСальдо);
		КонецЦикла;
		Для Каждого СтрокаИтоговПоВзаиморасчетам Из МассивСтрокиСальдо Цикл
			ОбластьСальдоПропись.Параметры.ДатаСальдо		= Формат(ДатаСальдо, "ДФ=dd.MM.yyyy");
			ОбластьСальдоПропись.Параметры.СальдоПрописью	= Exprovip.ПрописьЧисла(МодульЧисла(СтрокаИтоговПоВзаиморасчетам.СуммаОстаток) ,СтрокаИтоговПоВзаиморасчетам.Валюта);
			ОбластьСальдоПропись.Параметры.Контрагент		= ВыборкаКонтрагент.Контрагент;
			
			Если СтрокаИтоговПоВзаиморасчетам.СуммаОстаток < 0 Тогда
				ОбластьСальдоПропись.Параметры.Перед = "";
			Иначе
				ОбластьСальдоПропись.Параметры.Перед = "перед ";
			КонецЕсли;
			
			Результат.Вывести(ОбластьСальдоПропись);
		КонецЦикла;		
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры

&НаСервере
Функция МодульЧисла(ВходящееЧисло)
	Если ВходящееЧисло < 0 Тогда
		Возврат - ВходящееЧисло;
	Иначе
		Возврат ВходящееЧисло;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ТаблицаИтоговПоВзаиморасчетам()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПериодОтчета.ДатаОкончания);
	Запрос.УстановитьПараметр("Контрагенты", СписокКонтрагентов.ВыгрузитьЗначения());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыКлиентыОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыКлиентыОстатки.Валюта КАК Валюта,
	|	ВзаиморасчетыКлиентыОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКлиенты.Остатки(&КонецПериода, Контрагент В ИЕРАРХИИ (&Контрагенты)) КАК ВзаиморасчетыКлиентыОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Возврат Таблица;
КонецФункции

&НаСервере
Функция ТаблицаИтогов()
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Таблица.Колонки.Добавить("Дебет", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Кредит", Новый ОписаниеТипов("Число"));
	
	Возврат Таблица;
КонецФункции

#КонецОбласти
